# 生成关键点
import random


# 偏向

# LL：正常
# RL：秀气
# LR：英气
# RR：婉约


class Random:

    @staticmethod
    def RandomName():
        f_first = ['晓', '含', '思', '诗', '秀', '桂', '素', '悦', '君', '佳', '丽', '璐', '依', '言', '兰', '清', '文', '慧', '玉', '心',
                   '静', '萤', '盈', '颖', '迎',
                   '亚', '雅', '云', '舒', '俊']
        f_end = ['雅', '涛', '娟', '婷', '玉', '钰', '梅', '云', '慧', '香', '巧', '静', '媛', '莲', '霞', '倩', '茹', '敏', '瑶', '萌',
                 '素',
                 '然',
                 '兮', '雨', '萍', '苹', '幸', '深', '芬', '文', '敏', '梅', '露']

        m_first = ['深', '平', '晓', '慎', '江', '金', '景', '庆', '长', '皓', '守', '', '', '', '', '', '', '', '', '', '', '', '',
                   '', '',
                   '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '',
                   '', '', '', '', '', '', '', '', '', '', ]
        m_end = ['文', '磊', '华', '凯', '楷', '亮', '浩', '乐', '亮', '海', '瑜', '彧', '强', '容', '洋', '湘', '祥', '志', '希', '望',
                 '念', '先', '东', '旻', '晓', '策', '平', '宾', '冰', '凝', '宁', '信', '勤', '庆', '令', '秋', '缪', '烁', '朔', '渥',
                 '博', '莫',
                 '辰', '觉', '榷', '时', '亘', '务', '亭', '逸', '礼', '玺', '昔', '典', '白', '况', '贯', '科', '阁', '涯', '皓', '昊']
        return f_first[random.randint(0, len(f_first) - 1)] + f_end[random.randint(0, len(f_end) - 1)]

    @staticmethod
    def getName():
        fn = ['赵', '钱', '孙', '李', '周', '吴', '郑', '王', '冯', '陈', '褚', '卫', '蒋', '沈', '韩', '杨', '朱', '岑', '尤', '许', '何',
              '吕', '施', '张', '孔', '曹', '严', '华', '金', '魏', '陶', '姜', '戚', '谢', '邹', '喻', '柏', '水', '徐']
        return fn[random.randint(0, len(fn) - 1)] + Random.RandomName()
        # return '赵' + Random.RandomName()


while True:
    print(Random.getName())
